msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
union un_iicf1 {
    unsigned char iicf1;
    struct {
        unsigned char iicrsv1 :1;
        unsigned char stcen1 :1;
        unsigned char :4;
        unsigned char iicbsy1 :1;
        unsigned char stcf1 :1;
    } BIT;
};
union un_tdr02 {
    unsigned short tdr02;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr03 {
    unsigned short tdr03;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr03l {
    unsigned char tdr03l;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_tdr03h {
    unsigned char tdr03h;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_tdr04 {
    unsigned short tdr04;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr05 {
    unsigned short tdr05;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr06 {
    unsigned short tdr06;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr07 {
    unsigned short tdr07;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr10 {
    unsigned short tdr10;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr11 {
    unsigned short tdr11;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr11l {
    unsigned char tdr11l;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_tdr11h {
    unsigned char tdr11h;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
