msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
union un_tdr12 {
    unsigned short tdr12;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr13 {
    unsigned short tdr13;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr13l {
    unsigned char tdr13l;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_tdr13h {
    unsigned char tdr13h;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_tdr14 {
    unsigned short tdr14;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr15 {
    unsigned short tdr15;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr16 {
    unsigned short tdr16;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_tdr17 {
    unsigned short tdr17;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_flpmc {
    unsigned char flpmc;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_flars {
    unsigned char flars;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_flapl {
    unsigned short flapl;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_flaph {
    unsigned char flaph;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_fssq {
    unsigned char fssq;
    struct {
        unsigned char :6;
        unsigned char fsstp :1;
        unsigned char sqst :1;
    } BIT;
};
union un_flsedl {
    unsigned short flsedl;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_flsedh {
    unsigned char flsedh;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_flrst {
    unsigned char flrst;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_fsastl {
    unsigned char fsastl;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_fsasth {
    unsigned char fsasth;
    struct {
        unsigned char :6;
        unsigned char sqend :1;
        unsigned char esqend :1;
    } BIT;
};
union un_flwl {
    unsigned short flwl;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_flwh {
    unsigned short flwh;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_itmc {
    unsigned short itmc;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_sec {
    unsigned char sec;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_min {
    unsigned char min;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
