msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
union un_hour {
    unsigned char hour;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_week {
    unsigned char week;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_day {
    unsigned char day;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_month {
    unsigned char month;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_year {
    unsigned char year;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_subcud {
    unsigned char subcud;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_alarmwm {
    unsigned char alarmwm;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_alarmwh {
    unsigned char alarmwh;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_alarmww {
    unsigned char alarmww;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_rtcc0 {
    unsigned char rtcc0;
    struct {
        unsigned char :5;
        unsigned char rcloe1 :1;
        unsigned char :1;
        unsigned char rtce :1;
    } BIT;
};
union un_rtcc1 {
    unsigned char rtcc1;
    struct {
        unsigned char rwait :1;
        unsigned char rwst :1;
        unsigned char :1;
        unsigned char rifg :1;
        unsigned char wafg :1;
        unsigned char :1;
        unsigned char walie :1;
        unsigned char wale :1;
    } BIT;
};
union un_cmc {
    unsigned char cmc;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_csc {
    unsigned char csc;
    struct {
        unsigned char hiostop :1;
        unsigned char :5;
        unsigned char xtstop :1;
        unsigned char mstop :1;
    } BIT;
};
union un_ostc {
    unsigned char ostc;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_osts {
    unsigned char osts;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_ckc {
    unsigned char ckc;
    struct {
        unsigned char :3;
        unsigned char sdiv :1;
        unsigned char mcm0 :1;
        unsigned char mcs :1;
        unsigned char css :1;
        unsigned char cls :1;
    } BIT;
};
union un_cks0 {
    unsigned char cks0;
    struct {
        unsigned char :7;
        unsigned char pcloe0 :1;
    } BIT;
};
union un_cks1 {
    unsigned char cks1;
    struct {
        unsigned char :7;
        unsigned char pcloe1 :1;
    } BIT;
};
union un_resf {
    unsigned char resf;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_lvim {
    unsigned char lvim;
    struct {
        unsigned char lvif :1;
        unsigned char lviomsk :1;
        unsigned char :5;
        unsigned char lvisen :1;
    } BIT;
};
union un_lvis {
    unsigned char lvis;
    struct {
        unsigned char lvilv :1;
        unsigned char :6;
        unsigned char lvimd :1;
    } BIT;
};
union un_wdte {
    unsigned char wdte;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_crcin {
    unsigned char crcin;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
