msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
union un_rxb {
    unsigned char rxb;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_txs {
    unsigned char txs;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_monsta0 {
    unsigned char monsta0;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_asim {
    unsigned char asim;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dsa0 {
    unsigned char dsa0;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dsa1 {
    unsigned char dsa1;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dra0 {
    unsigned short dra0;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_dra0l {
    unsigned char dra0l;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dra0h {
    unsigned char dra0h;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dra1 {
    unsigned short dra1;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_dra1l {
    unsigned char dra1l;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dra1h {
    unsigned char dra1h;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dbc0 {
    unsigned short dbc0;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_dbc0l {
    unsigned char dbc0l;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dbc0h {
    unsigned char dbc0h;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dbc1 {
    unsigned short dbc1;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_dbc1l {
    unsigned char dbc1l;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dbc1h {
    unsigned char dbc1h;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_dmc0 {
    unsigned char dmc0;
    struct {
        unsigned char :4;
        unsigned char dwait0 :1;
        unsigned char ds0 :1;
        unsigned char drs0 :1;
        unsigned char stg0 :1;
    } BIT;
};
union un_dmc1 {
    unsigned char dmc1;
    struct {
        unsigned char :4;
        unsigned char dwait1 :1;
        unsigned char ds1 :1;
        unsigned char drs1 :1;
        unsigned char stg1 :1;
    } BIT;
};
union un_drc0 {
    unsigned char drc0;
    struct {
        unsigned char dst0 :1;
        unsigned char :6;
        unsigned char den0 :1;
    } BIT;
};
union un_drc1 {
    unsigned char drc1;
    struct {
        unsigned char dst1 :1;
        unsigned char :6;
        unsigned char den1 :1;
    } BIT;
};
union un_if2 {
    unsigned short if2;
    struct {
        unsigned short tmif05 :1;
        unsigned short tmif06 :1;
        unsigned short tmif07 :1;
        unsigned short pif6 :1;
        unsigned short pif7 :1;
        unsigned short pif8 :1;
        unsigned short pif9 :1;
        unsigned short pif10 :1;
    } BIT;
};
union un_if2l {
    unsigned char if2l;
    struct {
        unsigned char tmif05 :1;
        unsigned char tmif06 :1;
        unsigned char tmif07 :1;
        unsigned char pif6 :1;
        unsigned char pif7 :1;
        unsigned char pif8 :1;
        unsigned char pif9 :1;
        unsigned char pif10 :1;
    } BIT;
};
union un_if2h {
    unsigned char if2h;
    struct {
        unsigned char pif11 :1;
        unsigned char tmif10 :1;
        unsigned char tmif11 :1;
        unsigned char tmif12 :1;
        unsigned char tmif13h :1;
        unsigned char mdif :1;
        unsigned char iicaif1 :1;
        unsigned char flif :1;
    } BIT;
};
