msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
union un_if3 {
    unsigned short if3;
    struct {
        unsigned short dmaif2 :1;
        unsigned short dmaif3 :1;
        unsigned short tmif14 :1;
        unsigned short tmif15 :1;
        unsigned short tmif16 :1;
        unsigned short tmif17 :1;
    } BIT;
};
union un_if3l {
    unsigned char if3l;
    struct {
        unsigned char dmaif2 :1;
        unsigned char dmaif3 :1;
        unsigned char tmif14 :1;
        unsigned char tmif15 :1;
        unsigned char tmif16 :1;
        unsigned char tmif17 :1;
    } BIT;
};
union un_mk2 {
    unsigned short mk2;
    struct {
        unsigned short tmmk05 :1;
        unsigned short tmmk06 :1;
        unsigned short tmmk07 :1;
        unsigned short pmk6 :1;
        unsigned short pmk7 :1;
        unsigned short pmk8 :1;
        unsigned short pmk9 :1;
        unsigned short pmk10 :1;
    } BIT;
};
union un_mk2l {
    unsigned char mk2l;
    struct {
        unsigned char tmmk05 :1;
        unsigned char tmmk06 :1;
        unsigned char tmmk07 :1;
        unsigned char pmk6 :1;
        unsigned char pmk7 :1;
        unsigned char pmk8 :1;
        unsigned char pmk9 :1;
        unsigned char pmk10 :1;
    } BIT;
};
union un_mk2h {
    unsigned char mk2h;
    struct {
        unsigned char pmk11 :1;
        unsigned char tmmk10 :1;
        unsigned char tmmk11 :1;
        unsigned char tmmk12 :1;
        unsigned char tmmk13h :1;
        unsigned char mdmk :1;
        unsigned char iicamk1 :1;
        unsigned char flmk :1;
    } BIT;
};
union un_mk3 {
    unsigned short mk3;
    struct {
        unsigned short dmamk2 :1;
        unsigned short dmamk3 :1;
        unsigned short tmmk14 :1;
        unsigned short tmmk15 :1;
        unsigned short tmmk16 :1;
        unsigned short tmmk17 :1;
    } BIT;
};
union un_mk3l {
    unsigned char mk3l;
    struct {
        unsigned char dmamk2 :1;
        unsigned char dmamk3 :1;
        unsigned char tmmk14 :1;
        unsigned char tmmk15 :1;
        unsigned char tmmk16 :1;
        unsigned char tmmk17 :1;
    } BIT;
};
union un_pr02 {
    unsigned short pr02;
    struct {
        unsigned short tmpr005 :1;
        unsigned short tmpr006 :1;
        unsigned short tmpr007 :1;
        unsigned short ppr06 :1;
        unsigned short ppr07 :1;
        unsigned short ppr08 :1;
        unsigned short ppr09 :1;
        unsigned short ppr010 :1;
    } BIT;
};
union un_pr02l {
    unsigned char pr02l;
    struct {
        unsigned char tmpr005 :1;
        unsigned char tmpr006 :1;
        unsigned char tmpr007 :1;
        unsigned char ppr06 :1;
        unsigned char ppr07 :1;
        unsigned char ppr08 :1;
        unsigned char ppr09 :1;
        unsigned char ppr010 :1;
    } BIT;
};
union un_pr02h {
    unsigned char pr02h;
    struct {
        unsigned char ppr011 :1;
        unsigned char tmpr010 :1;
        unsigned char tmpr011 :1;
        unsigned char tmpr012 :1;
        unsigned char tmpr013h :1;
        unsigned char mdpr0 :1;
        unsigned char iicapr01 :1;
        unsigned char flpr0 :1;
    } BIT;
};
union un_pr03 {
    unsigned short pr03;
    struct {
        unsigned short dmapr02 :1;
        unsigned short dmapr03 :1;
        unsigned short tmpr014 :1;
        unsigned short tmpr015 :1;
        unsigned short tmpr016 :1;
        unsigned short tmpr017 :1;
    } BIT;
};
union un_pr03l {
    unsigned char pr03l;
    struct {
        unsigned char dmapr02 :1;
        unsigned char dmapr03 :1;
        unsigned char tmpr014 :1;
        unsigned char tmpr015 :1;
        unsigned char tmpr016 :1;
        unsigned char tmpr017 :1;
    } BIT;
};
union un_pr12 {
    unsigned short pr12;
    struct {
        unsigned short tmpr105 :1;
        unsigned short tmpr106 :1;
        unsigned short tmpr107 :1;
        unsigned short ppr16 :1;
        unsigned short ppr17 :1;
        unsigned short ppr18 :1;
        unsigned short ppr19 :1;
        unsigned short ppr110 :1;
    } BIT;
};
union un_pr12l {
    unsigned char pr12l;
    struct {
        unsigned char tmpr105 :1;
        unsigned char tmpr106 :1;
        unsigned char tmpr107 :1;
        unsigned char ppr16 :1;
        unsigned char ppr17 :1;
        unsigned char ppr18 :1;
        unsigned char ppr19 :1;
        unsigned char ppr110 :1;
    } BIT;
};
union un_pr12h {
    unsigned char pr12h;
    struct {
        unsigned char ppr111 :1;
        unsigned char tmpr110 :1;
        unsigned char tmpr111 :1;
        unsigned char tmpr112 :1;
        unsigned char tmpr113h :1;
        unsigned char mdpr1 :1;
        unsigned char iicapr11 :1;
        unsigned char flpr1 :1;
    } BIT;
};
union un_pr13 {
    unsigned short pr13;
    struct {
        unsigned short dmapr12 :1;
        unsigned short dmapr13 :1;
        unsigned short tmpr114 :1;
        unsigned short tmpr115 :1;
        unsigned short tmpr116 :1;
        unsigned short tmpr117 :1;
    } BIT;
};
union un_pr13l {
    unsigned char pr13l;
    struct {
        unsigned char dmapr12 :1;
        unsigned char dmapr13 :1;
        unsigned char tmpr114 :1;
        unsigned char tmpr115 :1;
        unsigned char tmpr116 :1;
        unsigned char tmpr117 :1;
    } BIT;
};
union un_if0 {
    unsigned short if0;
    struct {
        unsigned short wdtiif :1;
        unsigned short lviif :1;
        unsigned short pif0 :1;
        unsigned short pif1 :1;
        unsigned short pif2 :1;
        unsigned short pif3 :1;
        unsigned short pif4 :1;
        unsigned short pif5 :1;
    } BIT;
};
union un_if0l {
    unsigned char if0l;
    struct {
        unsigned char wdtiif :1;
        unsigned char lviif :1;
        unsigned char pif0 :1;
        unsigned char pif1 :1;
        unsigned char pif2 :1;
        unsigned char pif3 :1;
        unsigned char pif4 :1;
        unsigned char pif5 :1;
    } BIT;
};
union un_if0h {
    unsigned char if0h;
    struct {
        unsigned char stif2 :1;
        unsigned char srif2 :1;
        unsigned char tmif11h :1;
        unsigned char dmaif0 :1;
        unsigned char dmaif1 :1;
        unsigned char stif0 :1;
        unsigned char srif0 :1;
        unsigned char tmif01h :1;
    } BIT;
};
union un_if1 {
    unsigned short if1;
    struct {
        unsigned short stif1 :1;
        unsigned short srif1 :1;
        unsigned short tmif03h :1;
        unsigned short iicaif0 :1;
        unsigned short tmif00 :1;
        unsigned short tmif01 :1;
        unsigned short tmif02 :1;
        unsigned short tmif03 :1;
    } BIT;
};
