msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
union un_if1l {
    unsigned char if1l;
    struct {
        unsigned char stif1 :1;
        unsigned char srif1 :1;
        unsigned char tmif03h :1;
        unsigned char iicaif0 :1;
        unsigned char tmif00 :1;
        unsigned char tmif01 :1;
        unsigned char tmif02 :1;
        unsigned char tmif03 :1;
    } BIT;
};
union un_if1h {
    unsigned char if1h;
    struct {
        unsigned char adif :1;
        unsigned char rtcif :1;
        unsigned char itif :1;
        unsigned char krif :1;
        unsigned char stif3 :1;
        unsigned char srif3 :1;
        unsigned char tmif13 :1;
        unsigned char tmif04 :1;
    } BIT;
};
union un_mk0 {
    unsigned short mk0;
    struct {
        unsigned short wdtimk :1;
        unsigned short lvimk :1;
        unsigned short pmk0 :1;
        unsigned short pmk1 :1;
        unsigned short pmk2 :1;
        unsigned short pmk3 :1;
        unsigned short pmk4 :1;
        unsigned short pmk5 :1;
    } BIT;
};
union un_mk0l {
    unsigned char mk0l;
    struct {
        unsigned char wdtimk :1;
        unsigned char lvimk :1;
        unsigned char pmk0 :1;
        unsigned char pmk1 :1;
        unsigned char pmk2 :1;
        unsigned char pmk3 :1;
        unsigned char pmk4 :1;
        unsigned char pmk5 :1;
    } BIT;
};
union un_mk0h {
    unsigned char mk0h;
    struct {
        unsigned char stmk2 :1;
        unsigned char srmk2 :1;
        unsigned char tmmk11h :1;
        unsigned char dmamk0 :1;
        unsigned char dmamk1 :1;
        unsigned char stmk0 :1;
        unsigned char srmk0 :1;
        unsigned char tmmk01h :1;
    } BIT;
};
union un_mk1 {
    unsigned short mk1;
    struct {
        unsigned short stmk1 :1;
        unsigned short srmk1 :1;
        unsigned short tmmk03h :1;
        unsigned short iicamk0 :1;
        unsigned short tmmk00 :1;
        unsigned short tmmk01 :1;
        unsigned short tmmk02 :1;
        unsigned short tmmk03 :1;
    } BIT;
};
union un_mk1l {
    unsigned char mk1l;
    struct {
        unsigned char stmk1 :1;
        unsigned char srmk1 :1;
        unsigned char tmmk03h :1;
        unsigned char iicamk0 :1;
        unsigned char tmmk00 :1;
        unsigned char tmmk01 :1;
        unsigned char tmmk02 :1;
        unsigned char tmmk03 :1;
    } BIT;
};
union un_mk1h {
    unsigned char mk1h;
    struct {
        unsigned char admk :1;
        unsigned char rtcmk :1;
        unsigned char itmk :1;
        unsigned char krmk :1;
        unsigned char stmk3 :1;
        unsigned char srmk3 :1;
        unsigned char tmmk13 :1;
        unsigned char tmmk04 :1;
    } BIT;
};
union un_pr00 {
    unsigned short pr00;
    struct {
        unsigned short wdtipr0 :1;
        unsigned short lvipr0 :1;
        unsigned short ppr00 :1;
        unsigned short ppr01 :1;
        unsigned short ppr02 :1;
        unsigned short ppr03 :1;
        unsigned short ppr04 :1;
        unsigned short ppr05 :1;
    } BIT;
};
union un_pr00l {
    unsigned char pr00l;
    struct {
        unsigned char wdtipr0 :1;
        unsigned char lvipr0 :1;
        unsigned char ppr00 :1;
        unsigned char ppr01 :1;
        unsigned char ppr02 :1;
        unsigned char ppr03 :1;
        unsigned char ppr04 :1;
        unsigned char ppr05 :1;
    } BIT;
};
union un_pr00h {
    unsigned char pr00h;
    struct {
        unsigned char stpr02 :1;
        unsigned char srpr02 :1;
        unsigned char tmpr011h :1;
        unsigned char dmapr00 :1;
        unsigned char dmapr01 :1;
        unsigned char stpr00 :1;
        unsigned char srpr00 :1;
        unsigned char tmpr001h :1;
    } BIT;
};
union un_pr01 {
    unsigned short pr01;
    struct {
        unsigned short stpr01 :1;
        unsigned short srpr01 :1;
        unsigned short tmpr003h :1;
        unsigned short iicapr00 :1;
        unsigned short tmpr000 :1;
        unsigned short tmpr001 :1;
        unsigned short tmpr002 :1;
        unsigned short tmpr003 :1;
    } BIT;
};
union un_pr01l {
    unsigned char pr01l;
    struct {
        unsigned char stpr01 :1;
        unsigned char srpr01 :1;
        unsigned char tmpr003h :1;
        unsigned char iicapr00 :1;
        unsigned char tmpr000 :1;
        unsigned char tmpr001 :1;
        unsigned char tmpr002 :1;
        unsigned char tmpr003 :1;
    } BIT;
};
union un_pr01h {
    unsigned char pr01h;
    struct {
        unsigned char adpr0 :1;
        unsigned char rtcpr0 :1;
        unsigned char itpr0 :1;
        unsigned char krpr0 :1;
        unsigned char stpr03 :1;
        unsigned char srpr03 :1;
        unsigned char tmpr013 :1;
        unsigned char tmpr004 :1;
    } BIT;
};
union un_pr10 {
    unsigned short pr10;
    struct {
        unsigned short wdtipr1 :1;
        unsigned short lvipr1 :1;
        unsigned short ppr10 :1;
        unsigned short ppr11 :1;
        unsigned short ppr12 :1;
        unsigned short ppr13 :1;
        unsigned short ppr14 :1;
        unsigned short ppr15 :1;
    } BIT;
};
union un_pr10l {
    unsigned char pr10l;
    struct {
        unsigned char wdtipr1 :1;
        unsigned char lvipr1 :1;
        unsigned char ppr10 :1;
        unsigned char ppr11 :1;
        unsigned char ppr12 :1;
        unsigned char ppr13 :1;
        unsigned char ppr14 :1;
        unsigned char ppr15 :1;
    } BIT;
};
union un_pr10h {
    unsigned char pr10h;
    struct {
        unsigned char stpr12 :1;
        unsigned char srpr12 :1;
        unsigned char tmpr111h :1;
        unsigned char dmapr10 :1;
        unsigned char dmapr11 :1;
        unsigned char stpr10 :1;
        unsigned char srpr10 :1;
        unsigned char tmpr101h :1;
    } BIT;
};
union un_pr11 {
    unsigned short pr11;
    struct {
        unsigned short stpr11 :1;
        unsigned short srpr11 :1;
        unsigned short tmpr103h :1;
        unsigned short iicapr10 :1;
        unsigned short tmpr100 :1;
        unsigned short tmpr101 :1;
        unsigned short tmpr102 :1;
        unsigned short tmpr103 :1;
    } BIT;
};
union un_pr11l {
    unsigned char pr11l;
    struct {
        unsigned char stpr11 :1;
        unsigned char srpr11 :1;
        unsigned char tmpr103h :1;
        unsigned char iicapr10 :1;
        unsigned char tmpr100 :1;
        unsigned char tmpr101 :1;
        unsigned char tmpr102 :1;
        unsigned char tmpr103 :1;
    } BIT;
};
union un_pr11h {
    unsigned char pr11h;
    struct {
        unsigned char adpr1 :1;
        unsigned char rtcpr1 :1;
        unsigned char itpr1 :1;
        unsigned char krpr1 :1;
        unsigned char stpr13 :1;
        unsigned char srpr13 :1;
        unsigned char tmpr113 :1;
        unsigned char tmpr104 :1;
    } BIT;
};
