msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
union un_mdal {
    unsigned short mdal;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_mula {
    unsigned short mula;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_mdah {
    unsigned short mdah;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_mulb {
    unsigned short mulb;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_mdbh {
    unsigned short mdbh;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_muloh {
    unsigned short muloh;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_mdbl {
    unsigned short mdbl;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_mulol {
    unsigned short mulol;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_pmc {
    unsigned char pmc;
    struct {
        unsigned char maa :1;
    } BIT;
};

#define P0 (*(volatile union un_p0 *)0xFFF00)
#define P1 (*(volatile union un_p1 *)0xFFF01)
#define P2 (*(volatile union un_p2 *)0xFFF02)
#define P3 (*(volatile union un_p3 *)0xFFF03)
#define P4 (*(volatile union un_p4 *)0xFFF04)
#define P5 (*(volatile union un_p5 *)0xFFF05)
#define P6 (*(volatile union un_p6 *)0xFFF06)
#define P7 (*(volatile union un_p7 *)0xFFF07)
#define P8 (*(volatile union un_p8 *)0xFFF08)
#define P9 (*(volatile union un_p9 *)0xFFF09)
#define P10 (*(volatile union un_p10 *)0xFFF0A)
#define P11 (*(volatile union un_p11 *)0xFFF0B)
#define P12 (*(volatile union un_p12 *)0xFFF0C)
#define P13 (*(volatile union un_p13 *)0xFFF0D)
#define P14 (*(volatile union un_p14 *)0xFFF0E)
#define P15 (*(volatile union un_p15 *)0xFFF0F)
#define SDR00 (*(volatile union un_sdr00 *)0xFFF10)
#define SIO00 (*(volatile union un_sio00 *)0xFFF10)
#define TXD0 (*(volatile union un_txd0 *)0xFFF10)
#define SDR01 (*(volatile union un_sdr01 *)0xFFF12)
#define RXD0 (*(volatile union un_rxd0 *)0xFFF12)
#define SIO01 (*(volatile union un_sio01 *)0xFFF12)
#define SDR12 (*(volatile union un_sdr12 *)0xFFF14)
#define SIO30 (*(volatile union un_sio30 *)0xFFF14)
#define TXD3 (*(volatile union un_txd3 *)0xFFF14)
#define SDR13 (*(volatile union un_sdr13 *)0xFFF16)
#define RXD3 (*(volatile union un_rxd3 *)0xFFF16)
#define SIO31 (*(volatile union un_sio31 *)0xFFF16)
#define TDR00 (*(volatile union un_tdr00 *)0xFFF18)
#define TDR01 (*(volatile union un_tdr01 *)0xFFF1A)
#define TDR01L (*(volatile union un_tdr01l *)0xFFF1A)
#define TDR01H (*(volatile union un_tdr01h *)0xFFF1B)
#define ADCR (*(volatile union un_adcr *)0xFFF1E)
#define ADCRH (*(volatile union un_adcrh *)0xFFF1F)
#define PM0 (*(volatile union un_pm0 *)0xFFF20)
#define PM1 (*(volatile union un_pm1 *)0xFFF21)
#define PM2 (*(volatile union un_pm2 *)0xFFF22)
#define PM3 (*(volatile union un_pm3 *)0xFFF23)
#define PM4 (*(volatile union un_pm4 *)0xFFF24)
#define PM5 (*(volatile union un_pm5 *)0xFFF25)
#define PM6 (*(volatile union un_pm6 *)0xFFF26)
#define PM7 (*(volatile union un_pm7 *)0xFFF27)
#define PM8 (*(volatile union un_pm8 *)0xFFF28)
#define PM9 (*(volatile union un_pm9 *)0xFFF29)
#define PM10 (*(volatile union un_pm10 *)0xFFF2A)
#define PM11 (*(volatile union un_pm11 *)0xFFF2B)
#define PM12 (*(volatile union un_pm12 *)0xFFF2C)
#define PM14 (*(volatile union un_pm14 *)0xFFF2E)
#define PM15 (*(volatile union un_pm15 *)0xFFF2F)
#define ADM0 (*(volatile union un_adm0 *)0xFFF30)
#define ADS (*(volatile union un_ads *)0xFFF31)
#define ADM1 (*(volatile union un_adm1 *)0xFFF32)
#define KRM (*(volatile union un_krm *)0xFFF37)
#define EGP0 (*(volatile union un_egp0 *)0xFFF38)
#define EGN0 (*(volatile union un_egn0 *)0xFFF39)
#define EGP1 (*(volatile union un_egp1 *)0xFFF3A)
#define EGN1 (*(volatile union un_egn1 *)0xFFF3B)
#define SDR02 (*(volatile union un_sdr02 *)0xFFF44)
#define SIO10 (*(volatile union un_sio10 *)0xFFF44)
#define TXD1 (*(volatile union un_txd1 *)0xFFF44)
#define SDR03 (*(volatile union un_sdr03 *)0xFFF46)
#define RXD1 (*(volatile union un_rxd1 *)0xFFF46)
#define SIO11 (*(volatile union un_sio11 *)0xFFF46)
#define SDR10 (*(volatile union un_sdr10 *)0xFFF48)
#define SIO20 (*(volatile union un_sio20 *)0xFFF48)
#define TXD2 (*(volatile union un_txd2 *)0xFFF48)
#define SDR11 (*(volatile union un_sdr11 *)0xFFF4A)
#define RXD2 (*(volatile union un_rxd2 *)0xFFF4A)
#define SIO21 (*(volatile union un_sio21 *)0xFFF4A)
#define IICA0 (*(volatile union un_iica0 *)0xFFF50)
#define IICS0 (*(volatile union un_iics0 *)0xFFF51)
#define IICF0 (*(volatile union un_iicf0 *)0xFFF52)
#define IICA1 (*(volatile union un_iica1 *)0xFFF54)
#define IICS1 (*(volatile union un_iics1 *)0xFFF55)
#define IICF1 (*(volatile union un_iicf1 *)0xFFF56)
#define TDR02 (*(volatile union un_tdr02 *)0xFFF64)
#define TDR03 (*(volatile union un_tdr03 *)0xFFF66)
#define TDR03L (*(volatile union un_tdr03l *)0xFFF66)
#define TDR03H (*(volatile union un_tdr03h *)0xFFF67)
#define TDR04 (*(volatile union un_tdr04 *)0xFFF68)
#define TDR05 (*(volatile union un_tdr05 *)0xFFF6A)
#define TDR06 (*(volatile union un_tdr06 *)0xFFF6C)
#define TDR07 (*(volatile union un_tdr07 *)0xFFF6E)
#define TDR10 (*(volatile union un_tdr10 *)0xFFF70)
#define TDR11 (*(volatile union un_tdr11 *)0xFFF72)
#define TDR11L (*(volatile union un_tdr11l *)0xFFF72)
#define TDR11H (*(volatile union un_tdr11h *)0xFFF73)
#define TDR12 (*(volatile union un_tdr12 *)0xFFF74)
#define TDR13 (*(volatile union un_tdr13 *)0xFFF76)
#define TDR13L (*(volatile union un_tdr13l *)0xFFF76)
#define TDR13H (*(volatile union un_tdr13h *)0xFFF77)
#define TDR14 (*(volatile union un_tdr14 *)0xFFF78)
#define TDR15 (*(volatile union un_tdr15 *)0xFFF7A)
#define TDR16 (*(volatile union un_tdr16 *)0xFFF7C)
#define TDR17 (*(volatile union un_tdr17 *)0xFFF7E)
#define FLPMC (*(volatile union un_flpmc *)0xFFF80)
#define FLARS (*(volatile union un_flars *)0xFFF81)
#define FLAPL (*(volatile union un_flapl *)0xFFF82)
#define FLAPH (*(volatile union un_flaph *)0xFFF84)
#define FSSQ (*(volatile union un_fssq *)0xFFF85)
#define FLSEDL (*(volatile union un_flsedl *)0xFFF86)
#define FLSEDH (*(volatile union un_flsedh *)0xFFF88)
#define FLRST (*(volatile union un_flrst *)0xFFF89)
#define FSASTL (*(volatile union un_fsastl *)0xFFF8A)
#define FSASTH (*(volatile union un_fsasth *)0xFFF8B)
#define FLWL (*(volatile union un_flwl *)0xFFF8C)
#define FLWH (*(volatile union un_flwh *)0xFFF8E)
#define ITMC (*(volatile union un_itmc *)0xFFF90)
#define SEC (*(volatile union un_sec *)0xFFF92)
#define MIN (*(volatile union un_min *)0xFFF93)
#define HOUR (*(volatile union un_hour *)0xFFF94)
#define WEEK (*(volatile union un_week *)0xFFF95)
#define DAY (*(volatile union un_day *)0xFFF96)
#define MONTH (*(volatile union un_month *)0xFFF97)
#define YEAR (*(volatile union un_year *)0xFFF98)
#define SUBCUD (*(volatile union un_subcud *)0xFFF99)
#define ALARMWM (*(volatile union un_alarmwm *)0xFFF9A)
#define ALARMWH (*(volatile union un_alarmwh *)0xFFF9B)
#define ALARMWW (*(volatile union un_alarmww *)0xFFF9C)
#define RTCC0 (*(volatile union un_rtcc0 *)0xFFF9D)
#define RTCC1 (*(volatile union un_rtcc1 *)0xFFF9E)
#define CMC (*(volatile union un_cmc *)0xFFFA0)
#define CSC (*(volatile union un_csc *)0xFFFA1)
#define OSTC (*(volatile union un_ostc *)0xFFFA2)
#define OSTS (*(volatile union un_osts *)0xFFFA3)
#define CKC (*(volatile union un_ckc *)0xFFFA4)
#define CKS0 (*(volatile union un_cks0 *)0xFFFA5)
#define CKS1 (*(volatile union un_cks1 *)0xFFFA6)
#define RESF (*(volatile union un_resf *)0xFFFA8)
#define LVIM (*(volatile union un_lvim *)0xFFFA9)
#define LVIS (*(volatile union un_lvis *)0xFFFAA)
#define WDTE (*(volatile union un_wdte *)0xFFFAB)
#define CRCIN (*(volatile union un_crcin *)0xFFFAC)
#define RXB (*(volatile union un_rxb *)0xFFFAD)
#define TXS (*(volatile union un_txs *)0xFFFAD)
#define MONSTA0 (*(volatile union un_monsta0 *)0xFFFAE)
#define ASIM (*(volatile union un_asim *)0xFFFAF)
#define DSA0 (*(volatile union un_dsa0 *)0xFFFB0)
#define DSA1 (*(volatile union un_dsa1 *)0xFFFB1)
#define DRA0 (*(volatile union un_dra0 *)0xFFFB2)
#define DRA0L (*(volatile union un_dra0l *)0xFFFB2)
#define DRA0H (*(volatile union un_dra0h *)0xFFFB3)
#define DRA1 (*(volatile union un_dra1 *)0xFFFB4)
#define DRA1L (*(volatile union un_dra1l *)0xFFFB4)
#define DRA1H (*(volatile union un_dra1h *)0xFFFB5)
#define DBC0 (*(volatile union un_dbc0 *)0xFFFB6)
#define DBC0L (*(volatile union un_dbc0l *)0xFFFB6)
#define DBC0H (*(volatile union un_dbc0h *)0xFFFB7)
#define DBC1 (*(volatile union un_dbc1 *)0xFFFB8)
#define DBC1L (*(volatile union un_dbc1l *)0xFFFB8)
#define DBC1H (*(volatile union un_dbc1h *)0xFFFB9)
#define DMC0 (*(volatile union un_dmc0 *)0xFFFBA)
#define DMC1 (*(volatile union un_dmc1 *)0xFFFBB)
#define DRC0 (*(volatile union un_drc0 *)0xFFFBC)
#define DRC1 (*(volatile union un_drc1 *)0xFFFBD)
#define IF2 (*(volatile union un_if2 *)0xFFFD0)
#define IF2L (*(volatile union un_if2l *)0xFFFD0)
#define IF2H (*(volatile union un_if2h *)0xFFFD1)
#define IF3 (*(volatile union un_if3 *)0xFFFD2)
#define IF3L (*(volatile union un_if3l *)0xFFFD2)
#define MK2 (*(volatile union un_mk2 *)0xFFFD4)
#define MK2L (*(volatile union un_mk2l *)0xFFFD4)
#define MK2H (*(volatile union un_mk2h *)0xFFFD5)
#define MK3 (*(volatile union un_mk3 *)0xFFFD6)
#define MK3L (*(volatile union un_mk3l *)0xFFFD6)
#define PR02 (*(volatile union un_pr02 *)0xFFFD8)
#define PR02L (*(volatile union un_pr02l *)0xFFFD8)
#define PR02H (*(volatile union un_pr02h *)0xFFFD9)
#define PR03 (*(volatile union un_pr03 *)0xFFFDA)
#define PR03L (*(volatile union un_pr03l *)0xFFFDA)
#define PR12 (*(volatile union un_pr12 *)0xFFFDC)
#define PR12L (*(volatile union un_pr12l *)0xFFFDC)
#define PR12H (*(volatile union un_pr12h *)0xFFFDD)
#define PR13 (*(volatile union un_pr13 *)0xFFFDE)
#define PR13L (*(volatile union un_pr13l *)0xFFFDE)
#define IF0 (*(volatile union un_if0 *)0xFFFE0)
#define IF0L (*(volatile union un_if0l *)0xFFFE0)
#define IF0H (*(volatile union un_if0h *)0xFFFE1)
#define IF1 (*(volatile union un_if1 *)0xFFFE2)
#define IF1L (*(volatile union un_if1l *)0xFFFE2)
#define IF1H (*(volatile union un_if1h *)0xFFFE3)
#define MK0 (*(volatile union un_mk0 *)0xFFFE4)
#define MK0L (*(volatile union un_mk0l *)0xFFFE4)
#define MK0H (*(volatile union un_mk0h *)0xFFFE5)
#define MK1 (*(volatile union un_mk1 *)0xFFFE6)
#define MK1L (*(volatile union un_mk1l *)0xFFFE6)
#define MK1H (*(volatile union un_mk1h *)0xFFFE7)
#define PR00 (*(volatile union un_pr00 *)0xFFFE8)
#define PR00L (*(volatile union un_pr00l *)0xFFFE8)
#define PR00H (*(volatile union un_pr00h *)0xFFFE9)
#define PR01 (*(volatile union un_pr01 *)0xFFFEA)
#define PR01L (*(volatile union un_pr01l *)0xFFFEA)
#define PR01H (*(volatile union un_pr01h *)0xFFFEB)
#define PR10 (*(volatile union un_pr10 *)0xFFFEC)
#define PR10L (*(volatile union un_pr10l *)0xFFFEC)
#define PR10H (*(volatile union un_pr10h *)0xFFFED)
#define PR11 (*(volatile union un_pr11 *)0xFFFEE)
#define PR11L (*(volatile union un_pr11l *)0xFFFEE)
#define PR11H (*(volatile union un_pr11h *)0xFFFEF)
#define MDAL (*(volatile union un_mdal *)0xFFFF0)
#define MULA (*(volatile union un_mula *)0xFFFF0)
#define MDAH (*(volatile union un_mdah *)0xFFFF2)
#define MULB (*(volatile union un_mulb *)0xFFFF2)
#define MDBH (*(volatile union un_mdbh *)0xFFFF4)
#define MULOH (*(volatile union un_muloh *)0xFFFF4)
#define MDBL (*(volatile union un_mdbl *)0xFFFF6)
#define MULOL (*(volatile union un_mulol *)0xFFFF6)
#define PMC (*(volatile union un_pmc *)0xFFFFE)

