msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
/*
 Sfr bits
 */
#define ADCE ADM0.BIT.adce
#define ADCS ADM0.BIT.adcs
#define SPD0 IICS0.BIT.spd0
#define STD0 IICS0.BIT.std0
#define ACKD0 IICS0.BIT.ackd0
#define TRC0 IICS0.BIT.trc0
#define COI0 IICS0.BIT.coi0
#define EXC0 IICS0.BIT.exc0
#define ALD0 IICS0.BIT.ald0
#define MSTS0 IICS0.BIT.msts0
#define IICRSV0 IICF0.BIT.iicrsv0
#define STCEN0 IICF0.BIT.stcen0
#define IICBSY0 IICF0.BIT.iicbsy0
#define STCF0 IICF0.BIT.stcf0
#define SPD1 IICS1.BIT.spd1
#define STD1 IICS1.BIT.std1
#define ACKD1 IICS1.BIT.ackd1
#define TRC1 IICS1.BIT.trc1
#define COI1 IICS1.BIT.coi1
#define EXC1 IICS1.BIT.exc1
#define ALD1 IICS1.BIT.ald1
#define MSTS1 IICS1.BIT.msts1
#define IICRSV1 IICF1.BIT.iicrsv1
#define STCEN1 IICF1.BIT.stcen1
#define IICBSY1 IICF1.BIT.iicbsy1
#define STCF1 IICF1.BIT.stcf1
#define FSSTP FSSQ.BIT.fsstp
#define SQST FSSQ.BIT.sqst
#define SQEND FSASTH.BIT.sqend
#define ESQEND FSASTH.BIT.esqend
#define RCLOE1 RTCC0.BIT.rcloe1
#define RTCE RTCC0.BIT.rtce
#define RWAIT RTCC1.BIT.rwait
#define RWST RTCC1.BIT.rwst
#define RIFG RTCC1.BIT.rifg
#define WAFG RTCC1.BIT.wafg
#define WALIE RTCC1.BIT.walie
#define WALE RTCC1.BIT.wale
#define HIOSTOP CSC.BIT.hiostop
#define XTSTOP CSC.BIT.xtstop
#define MSTOP CSC.BIT.mstop
#define SDIV CKC.BIT.sdiv
#define MCM0 CKC.BIT.mcm0
#define MCS CKC.BIT.mcs
#define CSS CKC.BIT.css
#define CLS CKC.BIT.cls
#define PCLOE0 CKS0.BIT.pcloe0
#define PCLOE1 CKS1.BIT.pcloe1
#define LVIF LVIM.BIT.lvif
#define LVIOMSK LVIM.BIT.lviomsk
#define LVISEN LVIM.BIT.lvisen
#define LVILV LVIS.BIT.lvilv
#define LVIMD LVIS.BIT.lvimd
#define DWAIT0 DMC0.BIT.dwait0
#define DS0 DMC0.BIT.ds0
#define DRS0 DMC0.BIT.drs0
#define STG0 DMC0.BIT.stg0
#define DWAIT1 DMC1.BIT.dwait1
#define DS1 DMC1.BIT.ds1
#define DRS1 DMC1.BIT.drs1
#define STG1 DMC1.BIT.stg1
#define DST0 DRC0.BIT.dst0
#define DEN0 DRC0.BIT.den0
#define DST1 DRC1.BIT.dst1
#define DEN1 DRC1.BIT.den1
#define TMIF05 IF2.BIT.tmif05
#define TMIF06 IF2.BIT.tmif06
#define TMIF07 IF2.BIT.tmif07
#define PIF6 IF2.BIT.pif6
#define PIF7 IF2.BIT.pif7
#define PIF8 IF2.BIT.pif8
#define PIF9 IF2.BIT.pif9
#define PIF10 IF2.BIT.pif10
#define PIF11 IF2H.BIT.pif11
#define TMIF10 IF2H.BIT.tmif10
#define TMIF11 IF2H.BIT.tmif11
#define TMIF12 IF2H.BIT.tmif12
#define SREIF3 IF2H.BIT.tmif13h
#define TMIF13H IF2H.BIT.tmif13h
#define MDIF IF2H.BIT.mdif
#define IICAIF1 IF2H.BIT.iicaif1
#define FLIF IF2H.BIT.flif
#define DMAIF2 IF3.BIT.dmaif2
#define DMAIF3 IF3.BIT.dmaif3
#define TMIF14 IF3.BIT.tmif14
#define TMIF15 IF3.BIT.tmif15
#define TMIF16 IF3.BIT.tmif16
#define TMIF17 IF3.BIT.tmif17
#define TMMK05 MK2.BIT.tmmk05
#define TMMK06 MK2.BIT.tmmk06
#define TMMK07 MK2.BIT.tmmk07
#define PMK6 MK2.BIT.pmk6
#define PMK7 MK2.BIT.pmk7
#define PMK8 MK2.BIT.pmk8
#define PMK9 MK2.BIT.pmk9
#define PMK10 MK2.BIT.pmk10
#define PMK11 MK2H.BIT.pmk11
#define TMMK10 MK2H.BIT.tmmk10
#define TMMK11 MK2H.BIT.tmmk11
#define TMMK12 MK2H.BIT.tmmk12
#define SREMK3 MK2H.BIT.tmmk13h
#define TMMK13H MK2H.BIT.tmmk13h
#define MDMK MK2H.BIT.mdmk
#define IICAMK1 MK2H.BIT.iicamk1
#define FLMK MK2H.BIT.flmk
#define DMAMK2 MK3.BIT.dmamk2
#define DMAMK3 MK3.BIT.dmamk3
#define TMMK14 MK3.BIT.tmmk14
#define TMMK15 MK3.BIT.tmmk15
#define TMMK16 MK3.BIT.tmmk16
#define TMMK17 MK3.BIT.tmmk17
#define TMPR005 PR02.BIT.tmpr005
#define TMPR006 PR02.BIT.tmpr006
#define TMPR007 PR02.BIT.tmpr007
#define PPR06 PR02.BIT.ppr06
#define PPR07 PR02.BIT.ppr07
#define PPR08 PR02.BIT.ppr08
#define PPR09 PR02.BIT.ppr09
#define PPR010 PR02.BIT.ppr010
#define PPR011 PR02H.BIT.ppr011
#define TMPR010 PR02H.BIT.tmpr010
#define TMPR011 PR02H.BIT.tmpr011
#define TMPR012 PR02H.BIT.tmpr012
#define SREPR03 PR02H.BIT.tmpr013h
#define TMPR013H PR02H.BIT.tmpr013h
#define MDPR0 PR02H.BIT.mdpr0
#define IICAPR01 PR02H.BIT.iicapr01
#define FLPR0 PR02H.BIT.flpr0
#define DMAPR02 PR03.BIT.dmapr02
#define DMAPR03 PR03.BIT.dmapr03
#define TMPR014 PR03.BIT.tmpr014
#define TMPR015 PR03.BIT.tmpr015
#define TMPR016 PR03.BIT.tmpr016
#define TMPR017 PR03.BIT.tmpr017
#define TMPR105 PR12.BIT.tmpr105
#define TMPR106 PR12.BIT.tmpr106
#define TMPR107 PR12.BIT.tmpr107
#define PPR16 PR12.BIT.ppr16
#define PPR17 PR12.BIT.ppr17
#define PPR18 PR12.BIT.ppr18
#define PPR19 PR12.BIT.ppr19
#define PPR110 PR12.BIT.ppr110
#define PPR111 PR12H.BIT.ppr111
#define TMPR110 PR12H.BIT.tmpr110
#define TMPR111 PR12H.BIT.tmpr111
#define TMPR112 PR12H.BIT.tmpr112
#define SREPR13 PR12H.BIT.tmpr113h
#define TMPR113H PR12H.BIT.tmpr113h
#define MDPR1 PR12H.BIT.mdpr1
#define IICAPR11 PR12H.BIT.iicapr11
#define FLPR1 PR12H.BIT.flpr1
#define DMAPR12 PR13.BIT.dmapr12
#define DMAPR13 PR13.BIT.dmapr13
#define TMPR114 PR13.BIT.tmpr114
#define TMPR115 PR13.BIT.tmpr115
#define TMPR116 PR13.BIT.tmpr116
#define TMPR117 PR13.BIT.tmpr117
#define WDTIIF IF0.BIT.wdtiif
#define LVIIF IF0.BIT.lviif
#define PIF0 IF0.BIT.pif0
#define PIF1 IF0.BIT.pif1
#define PIF2 IF0.BIT.pif2
#define PIF3 IF0.BIT.pif3
#define PIF4 IF0.BIT.pif4
#define PIF5 IF0.BIT.pif5
#define CSIIF20 IF0H.BIT.stif2
#define IICIF20 IF0H.BIT.stif2
#define STIF2 IF0H.BIT.stif2
#define CSIIF21 IF0H.BIT.srif2
#define IICIF21 IF0H.BIT.srif2
#define SRIF2 IF0H.BIT.srif2
#define SREIF2 IF0H.BIT.tmif11h
#define TMIF11H IF0H.BIT.tmif11h
#define DMAIF0 IF0H.BIT.dmaif0
#define DMAIF1 IF0H.BIT.dmaif1
#define CSIIF00 IF0H.BIT.stif0
#define IICIF00 IF0H.BIT.stif0
#define STIF0 IF0H.BIT.stif0
#define CSIIF01 IF0H.BIT.srif0
#define IICIF01 IF0H.BIT.srif0
#define SRIF0 IF0H.BIT.srif0
#define SREIF0 IF0H.BIT.tmif01h
#define TMIF01H IF0H.BIT.tmif01h
#define CSIIF10 IF1.BIT.stif1
#define IICIF10 IF1.BIT.stif1
#define STIF1 IF1.BIT.stif1
#define CSIIF11 IF1.BIT.srif1
#define IICIF11 IF1.BIT.srif1
#define SRIF1 IF1.BIT.srif1
#define SREIF1 IF1.BIT.tmif03h
#define TMIF03H IF1.BIT.tmif03h
#define IICAIF0 IF1.BIT.iicaif0
#define TMIF00 IF1.BIT.tmif00
#define TMIF01 IF1.BIT.tmif01
#define TMIF02 IF1.BIT.tmif02
#define TMIF03 IF1.BIT.tmif03
#define ADIF IF1H.BIT.adif
#define RTCIF IF1H.BIT.rtcif
#define ITIF IF1H.BIT.itif
#define KRIF IF1H.BIT.krif
#define CSIIF30 IF1H.BIT.stif3
#define IICIF30 IF1H.BIT.stif3
#define STIF3 IF1H.BIT.stif3
#define CSIIF31 IF1H.BIT.srif3
#define IICIF31 IF1H.BIT.srif3
#define SRIF3 IF1H.BIT.srif3
#define TMIF13 IF1H.BIT.tmif13
#define TMIF04 IF1H.BIT.tmif04
#define WDTIMK MK0.BIT.wdtimk
#define LVIMK MK0.BIT.lvimk
#define PMK0 MK0.BIT.pmk0
#define PMK1 MK0.BIT.pmk1
#define PMK2 MK0.BIT.pmk2
#define PMK3 MK0.BIT.pmk3
#define PMK4 MK0.BIT.pmk4
#define PMK5 MK0.BIT.pmk5
#define CSIMK20 MK0H.BIT.stmk2
#define IICMK20 MK0H.BIT.stmk2
#define STMK2 MK0H.BIT.stmk2
#define CSIMK21 MK0H.BIT.srmk2
#define IICMK21 MK0H.BIT.srmk2
#define SRMK2 MK0H.BIT.srmk2
#define SREMK2 MK0H.BIT.tmmk11h
#define TMMK11H MK0H.BIT.tmmk11h
#define DMAMK0 MK0H.BIT.dmamk0
#define DMAMK1 MK0H.BIT.dmamk1
#define CSIMK00 MK0H.BIT.stmk0
#define IICMK00 MK0H.BIT.stmk0
#define STMK0 MK0H.BIT.stmk0
#define CSIMK01 MK0H.BIT.srmk0
#define IICMK01 MK0H.BIT.srmk0
#define SRMK0 MK0H.BIT.srmk0
#define SREMK0 MK0H.BIT.tmmk01h
#define TMMK01H MK0H.BIT.tmmk01h
#define CSIMK10 MK1.BIT.stmk1
#define IICMK10 MK1.BIT.stmk1
#define STMK1 MK1.BIT.stmk1
#define CSIMK11 MK1.BIT.srmk1
#define IICMK11 MK1.BIT.srmk1
#define SRMK1 MK1.BIT.srmk1
#define SREMK1 MK1.BIT.tmmk03h
#define TMMK03H MK1.BIT.tmmk03h
#define IICAMK0 MK1.BIT.iicamk0
#define TMMK00 MK1.BIT.tmmk00
#define TMMK01 MK1.BIT.tmmk01
#define TMMK02 MK1.BIT.tmmk02
#define TMMK03 MK1.BIT.tmmk03
#define ADMK MK1H.BIT.admk
#define RTCMK MK1H.BIT.rtcmk
#define ITMK MK1H.BIT.itmk
#define KRMK MK1H.BIT.krmk
#define CSIMK30 MK1H.BIT.stmk3
#define IICMK30 MK1H.BIT.stmk3
#define STMK3 MK1H.BIT.stmk3
#define CSIMK31 MK1H.BIT.srmk3
#define IICMK31 MK1H.BIT.srmk3
#define SRMK3 MK1H.BIT.srmk3
#define TMMK13 MK1H.BIT.tmmk13
#define TMMK04 MK1H.BIT.tmmk04
#define WDTIPR0 PR00.BIT.wdtipr0
#define LVIPR0 PR00.BIT.lvipr0
#define PPR00 PR00.BIT.ppr00
#define PPR01 PR00.BIT.ppr01
#define PPR02 PR00.BIT.ppr02
#define PPR03 PR00.BIT.ppr03
#define PPR04 PR00.BIT.ppr04
#define PPR05 PR00.BIT.ppr05
#define CSIPR020 PR00H.BIT.stpr02
#define IICPR020 PR00H.BIT.stpr02
#define STPR02 PR00H.BIT.stpr02
#define CSIPR021 PR00H.BIT.srpr02
#define IICPR021 PR00H.BIT.srpr02
#define SRPR02 PR00H.BIT.srpr02
#define SREPR02 PR00H.BIT.tmpr011h
#define TMPR011H PR00H.BIT.tmpr011h
#define DMAPR00 PR00H.BIT.dmapr00
#define DMAPR01 PR00H.BIT.dmapr01
#define CSIPR000 PR00H.BIT.stpr00
#define IICPR000 PR00H.BIT.stpr00
#define STPR00 PR00H.BIT.stpr00
#define CSIPR001 PR00H.BIT.srpr00
#define IICPR001 PR00H.BIT.srpr00
#define SRPR00 PR00H.BIT.srpr00
#define SREPR00 PR00H.BIT.tmpr001h
#define TMPR001H PR00H.BIT.tmpr001h
#define CSIPR010 PR01.BIT.stpr01
#define IICPR010 PR01.BIT.stpr01
#define STPR01 PR01.BIT.stpr01
#define CSIPR011 PR01.BIT.srpr01
#define IICPR011 PR01.BIT.srpr01
#define SRPR01 PR01.BIT.srpr01
#define SREPR01 PR01.BIT.tmpr003h
#define TMPR003H PR01.BIT.tmpr003h
#define IICAPR00 PR01.BIT.iicapr00
#define TMPR000 PR01.BIT.tmpr000
#define TMPR001 PR01.BIT.tmpr001
#define TMPR002 PR01.BIT.tmpr002
#define TMPR003 PR01.BIT.tmpr003
#define ADPR0 PR01H.BIT.adpr0
#define RTCPR0 PR01H.BIT.rtcpr0
#define ITPR0 PR01H.BIT.itpr0
#define KRPR0 PR01H.BIT.krpr0
#define CSIPR030 PR01H.BIT.stpr03
#define IICPR030 PR01H.BIT.stpr03
#define STPR03 PR01H.BIT.stpr03
#define CSIPR031 PR01H.BIT.srpr03
#define IICPR031 PR01H.BIT.srpr03
#define SRPR03 PR01H.BIT.srpr03
#define TMPR013 PR01H.BIT.tmpr013
#define TMPR004 PR01H.BIT.tmpr004
#define WDTIPR1 PR10.BIT.wdtipr1
#define LVIPR1 PR10.BIT.lvipr1
#define PPR10 PR10.BIT.ppr10
#define PPR11 PR10.BIT.ppr11
#define PPR12 PR10.BIT.ppr12
#define PPR13 PR10.BIT.ppr13
#define PPR14 PR10.BIT.ppr14
#define PPR15 PR10.BIT.ppr15
#define CSIPR120 PR10H.BIT.stpr12
#define IICPR120 PR10H.BIT.stpr12
#define STPR12 PR10H.BIT.stpr12
#define CSIPR121 PR10H.BIT.srpr12
#define IICPR121 PR10H.BIT.srpr12
#define SRPR12 PR10H.BIT.srpr12
#define SREPR12 PR10H.BIT.tmpr111h
#define TMPR111H PR10H.BIT.tmpr111h
#define DMAPR10 PR10H.BIT.dmapr10
#define DMAPR11 PR10H.BIT.dmapr11
#define CSIPR100 PR10H.BIT.stpr10
#define IICPR100 PR10H.BIT.stpr10
#define STPR10 PR10H.BIT.stpr10
#define CSIPR101 PR10H.BIT.srpr10
#define IICPR101 PR10H.BIT.srpr10
#define SRPR10 PR10H.BIT.srpr10
#define SREPR10 PR10H.BIT.tmpr101h
#define TMPR101H PR10H.BIT.tmpr101h
#define CSIPR110 PR11.BIT.stpr11
#define IICPR110 PR11.BIT.stpr11
#define STPR11 PR11.BIT.stpr11
#define CSIPR111 PR11.BIT.srpr11
#define IICPR111 PR11.BIT.srpr11
#define SRPR11 PR11.BIT.srpr11
#define SREPR11 PR11.BIT.tmpr103h
#define TMPR103H PR11.BIT.tmpr103h
#define IICAPR10 PR11.BIT.iicapr10
#define TMPR100 PR11.BIT.tmpr100
#define TMPR101 PR11.BIT.tmpr101
#define TMPR102 PR11.BIT.tmpr102
#define TMPR103 PR11.BIT.tmpr103
#define ADPR1 PR11H.BIT.adpr1
#define RTCPR1 PR11H.BIT.rtcpr1
#define ITPR1 PR11H.BIT.itpr1
#define KRPR1 PR11H.BIT.krpr1
#define CSIPR130 PR11H.BIT.stpr13
#define IICPR130 PR11H.BIT.stpr13
#define STPR13 PR11H.BIT.stpr13
#define CSIPR131 PR11H.BIT.srpr13
#define IICPR131 PR11H.BIT.srpr13
#define SRPR13 PR11H.BIT.srpr13
#define TMPR113 PR11H.BIT.tmpr113
#define TMPR104 PR11H.BIT.tmpr104
#define MAA PMC.BIT.maa

