msalau/rl78-samples-R5F100SLAFB/common/iodefine.h
/*
 Interrupt vector addresses
 */
#define RST_vect (0x0)
#define INTDBG_vect (0x2)
#define INTWDTI_vect (0x4)
#define INTLVI_vect (0x6)
#define INTP0_vect (0x8)
#define INTP1_vect (0xA)
#define INTP2_vect (0xC)
#define INTP3_vect (0xE)
#define INTP4_vect (0x10)
#define INTP5_vect (0x12)
#define INTCSI20_vect (0x14)
#define INTIIC20_vect (0x14)
#define INTST2_vect (0x14)
#define INTCSI21_vect (0x16)
#define INTIIC21_vect (0x16)
#define INTSR2_vect (0x16)
#define INTSRE2_vect (0x18)
#define INTTM11H_vect (0x18)
#define INTDMA0_vect (0x1A)
#define INTDMA1_vect (0x1C)
#define INTCSI00_vect (0x1E)
#define INTIIC00_vect (0x1E)
#define INTST0_vect (0x1E)
#define INTCSI01_vect (0x20)
#define INTIIC01_vect (0x20)
#define INTSR0_vect (0x20)
#define INTSRE0_vect (0x22)
#define INTTM01H_vect (0x22)
#define INTCSI10_vect (0x24)
#define INTIIC10_vect (0x24)
#define INTST1_vect (0x24)
#define INTCSI11_vect (0x26)
#define INTIIC11_vect (0x26)
#define INTSR1_vect (0x26)
#define INTSRE1_vect (0x28)
#define INTTM03H_vect (0x28)
#define INTIICA0_vect (0x2A)
#define INTTM00_vect (0x2C)
#define INTTM01_vect (0x2E)
#define INTTM02_vect (0x30)
#define INTTM03_vect (0x32)
#define INTAD_vect (0x34)
#define INTRTC_vect (0x36)
#define INTIT_vect (0x38)
#define INTKR_vect (0x3A)
#define INTCSI30_vect (0x3C)
#define INTIIC30_vect (0x3C)
#define INTST3_vect (0x3C)
#define INTCSI31_vect (0x3E)
#define INTIIC31_vect (0x3E)
#define INTSR3_vect (0x3E)
#define INTTM13_vect (0x40)
#define INTTM04_vect (0x42)
#define INTTM05_vect (0x44)
#define INTTM06_vect (0x46)
#define INTTM07_vect (0x48)
#define INTP6_vect (0x4A)
#define INTP7_vect (0x4C)
#define INTP8_vect (0x4E)
#define INTP9_vect (0x50)
#define INTP10_vect (0x52)
#define INTP11_vect (0x54)
#define INTTM10_vect (0x56)
#define INTTM11_vect (0x58)
#define INTTM12_vect (0x5A)
#define INTSRE3_vect (0x5C)
#define INTTM13H_vect (0x5C)
#define INTMD_vect (0x5E)
#define INTIICA1_vect (0x60)
#define INTFL_vect (0x62)
#define INTDMA2_vect (0x64)
#define INTDMA3_vect (0x66)
#define INTTM14_vect (0x68)
#define INTTM15_vect (0x6A)
#define INTTM16_vect (0x6C)
#define INTTM17_vect (0x6E)
#define BRK_I_vect (0x7E)
#define OPTION_BYTES_vect (0xC0)
#define SECURITY_ID_vect (0xC4)
#endif
